{
    "@context": "http://schema.org",
    "@type": "Recipe",
    "name": "Jamaican Curry Chicken and Potatoes",
    "description": "There’s nothing more comforting than chicken and potatoes, and this recipe is no exception. Getting its flavor and heat from a combination of mild Jamaican curry powder and Scotch bonnet pepper, it’s not as hot as some Indian or Thai curries. Jamaican curry powder tends to be heavy on turmeric and less on spice, and this recipe uses just one Scotch bonnet pepper, which is kept whole but punctured to gently release flavor. The result is more warming than spicy. Eat this one-pot recipe by itself as a kind of stew, or over rice, letting all the flavors meld together.",
    "author": {
        "@type": "Person",
        "name": "Millie Peartree"
    },
    "image": "https://static01.nyt.com/images/2020/01/26/dining/mp-curry-chicken/merlin_180213507_fa6be31c-a114-49ab-ab29-745dbf93ed2d-articleLarge.jpg",
    "totalTime": "PT1H30M",
    "recipeYield": "4 servings",
    "recipeCuisine": "caribbean",
    "recipeCategory": "dinner, poultry, main course",
    "keywords": "chicken legs, curry powder, potato",
    "aggregateRating": {
        "@type": "AggregateRating",
        "ratingValue": 4,
        "ratingCount": 782
    },
    "recipeIngredient": [
        "3 pounds bone-in, skin-on chicken legs and thighs, skin removed",
        "1 tablespoon garlic powder",
        "Kosher salt and black pepper",
        "2 tablespoons olive oil, plus more as needed",
        "1 large onion, sliced",
        "4 garlic cloves, minced",
        "2 tablespoons Jamaican hot curry powder, such as Jamaican Choice or Grace, plus more as needed",
        "1 Scotch bonnet or habanero pepper",
        "4 medium Yukon Gold potatoes, washed and quartered",
        "1 to 2 quarts chicken stock (reduce or add liquid depending on pot size)",
        "1 dried bay leaf",
        "2 fresh thyme sprigs",
        "1/4 cup cornstarch",
        "White rice, for serving"
    ],
    "recipeInstructions": [
        {
            "@context": "http://schema.org",
            "@type": "HowToStep",
            "text": "Place chicken in a large bowl. Season chicken with the garlic powder, 2 teaspoons salt and 1/2 teaspoon pepper, making sure it’s evenly coated. Let come to room temperature."
        },
        {
            "@context": "http://schema.org",
            "@type": "HowToStep",
            "text": "Heat a deep Dutch oven or heavy pan over medium-high. Drizzle in the olive oil. Add sliced onions, season with salt and pepper. Using a rubber spatula or wooden spoon, stir to combine, and cook until soft and fragrant, 3 to 4 minutes. Add garlic, stirring to keep the garlic from scorching, and cook for 30 seconds or until tender. Using a pair of tongs or a spoon, remove onions and garlic from the pan; set aside in a bowl."
        },
        {
            "@context": "http://schema.org",
            "@type": "HowToStep",
            "text": "If needed, add more oil to coat the bottom of the pan. Reduce the heat to medium. Add the room-temperature chicken to the pan, and sear chicken on both sides, in batches if necessary, until golden brown, about 7 to 8 minutes total."
        },
        {
            "@context": "http://schema.org",
            "@type": "HowToStep",
            "text": "Sprinkle curry powder over and around chicken. Let the spices bloom and toast until fragrant, about 2 minutes."
        },
        {
            "@context": "http://schema.org",
            "@type": "HowToStep",
            "text": "Add reserved onions and garlic to the pan. Using a paring knife, pierce the Scotch bonnet pepper. Add to the pan. Add potatoes, and stir to evenly coat chicken and potatoes."
        },
        {
            "@context": "http://schema.org",
            "@type": "HowToStep",
            "text": "Pour in chicken stock to nearly cover the chicken. Add the bay leaf and thyme sprigs. Bring to a simmer. Remove Scotch bonnet pepper. Cover pot and cook for 30 minutes, or until chicken is tender and falling off the bone. Taste and adjust the curry powder, salt and pepper as needed."
        },
        {
            "@context": "http://schema.org",
            "@type": "HowToStep",
            "text": "In a small bowl, combine cornstarch with 1/4 cup water to form a slurry. (The chicken curry can be eaten as is, like a soup, or slurry can be added to thicken the sauce to a gravy-like consistency.)  Add 1 tablespoon of the slurry, and bring to a boil to thicken, adding more slurry to reach desired consistency. Retrieve bay leaf and thyme stems and discard. Serve with rice."
        }
    ],
    "isAccessibleForFree": "False",
    "hasPart": {
        "@type": "WebPageElement",
        "isAccessibleForFree": "False",
        "cssSelector": ".recipe"
    },
    "publisher": {
        "@context": "http://schema.org",
        "@type": "Organization",
        "name": "NYT Cooking",
        "url": "https://cooking.nytimes.com",
        "alternateName": [
            "nytimes cooking",
            "New York Times Cooking"
        ],
        "image": [
            {
                "url": "https://static01.nyt.com/applications/cooking/80b7044/assets/SiteLogoRed.svg",
                "height": 31,
                "width": 168,
                "@context": "http://schema.org",
                "@type": "ImageObject"
            },
            {
                "url": "https://static01.nyt.com/applications/cooking/80b7044/assets/SiteLogoBlack.svg",
                "height": 24,
                "width": 131,
                "@context": "http://schema.org",
                "@type": "ImageObject"
            }
        ],
        "sameAs": [
            "https://www.facebook.com/groups/nytcooks/",
            "https://www.facebook.com/nytcooking/",
            "https://www.instagram.com/nytcooking/",
            "https://twitter.com/nytfood",
            "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"
        ]
    }
}